app/Controllers/AdminController.php

SELECT *
FROM `packages`
SELECT *
FROM `games`
WHERE `games`.`id` = '1'
SELECT *
FROM `games`
SELECT *
FROM `transactions`
---
    public function dashboard()
    {
        $packageModel = new PackageModel();
        $gameModel = new GameModel();
        $transactionModel = new TransactionModel();

        // Ambil semua paket
        $packages = $packageModel->asArray()->findAll(); // Pastikan data paket dikembalikan sebagai array

        // Tambahkan nama game ke setiap paket
        foreach ($packages as &$package) {
            $game = $gameModel->asArray()->find($package['game_id']); // Pastikan game dikembalikan sebagai array
            $package['game_name'] = $game['name'] ?? 'Game Tidak Ditemukan'; // Tambahkan fallback jika game tidak ditemukan
        }

        // Ambil semua game
        $games = $gameModel->asArray()->findAll(); // Pastikan games dikembalikan sebagai array

        // Ambil semua transaksi
        $transactions = $transactionModel->asArray()->findAll(); // Pastikan transactions dikembalikan sebagai array

SELECT *
FROM `games`
---
    public function managePackages($game_id = null)
    {
        $session = session();

        // Cek apakah user sudah login dan memiliki role admin
        if (!$session->get('isLoggedIn') || $session->get('role') != 'admin') {
            return redirect()->to('/admin/login');
        }

        // Jika $game_id tidak diberikan, tampilkan daftar game
        if (is_null($game_id)) {
            // Ambil data game
            $gameModel = new GameModel();
            $games = $gameModel->findAll(); // Ambil semua game