app/Controllers/LoginController.php

    public function login_process()
    {
        $session = session();
        $model = new UserModel();

        // Ambil data username dan password
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Cek apakah username dan password cocok
        $user = $model->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1