app/Controllers/TransactionController.php

    public function edit($id)
    {
        $db = \Config\Database::connect();
        $builder = $db->table('transactions');
        $builder->select(
            'transactions.*, users.username, games.name AS game_name, packages.package_name, transactions.payment_method'
        );
        $builder->join('users', 'transactions.user_id = users.id');
        $builder->join('games', 'transactions.game_id = games.id');
        $builder->join('packages', 'transactions.package_id = packages.id');
        $builder->where('transactions.id', $id);

        $transaction = $builder->get()->getRowArray();

        if (!$transaction) {
            return redirect()->to('/admin/transactions')->with('error', 'Transaksi tidak ditemukan.');
        }

        // Fetch data games dan packages untuk dropdown
        $games = $this->gameModel->findAll();
        $packages = $this->packageModel->findAll();
---
SELECT *
FROM `games`
SELECT *
FROM `packages`