app/Controllers/UserController.php

    public function topup()
    {
        // Ambil daftar game dari model
        $gameModel = new GameModel();
        $data['games'] = $gameModel->findAll(); // Ambil semua game
---
SELECT *
FROM `games`

    public function topup_game($game_id)
{
    $gameModel = new GameModel();
    $packageModel = new PackageModel();

    $game = $gameModel->find($game_id);
    $packages = $packageModel->where('game_id', $game_id)->findAll();
---
SELECT *
FROM `games`
WHERE `games`.`id` = '2'
SELECT *
FROM `packages`
WHERE `game_id` = '2'